sunhotelsbd/test5/bookingRQ.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <BookV2 xmlns="http://xml.sunhotels.net/15/">
      <userName>testagent</userName>
      <password>785623</password>
      <currency>USD</currency>
      <language>en</language>
      <email>alexis.sanchez@gmail.com</email>
      <checkInDate>2020-06-12</checkInDate>
      <checkOutDate>2020-06-14</checkOutDate>
      <roomId>15032331</roomId>
      <rooms>1</rooms>
      <adults>2</adults>
      <children>0</children>
      <infant>0</infant>
      <yourRef>jk12aac</yourRef>
      <specialrequest></specialrequest>
      <mealId>1</mealId>
      <adultGuest1FirstName>Alexis</adultGuest1FirstName>
      <adultGuest1LastName>Sanchez</adultGuest1LastName>
      <adultGuest2FirstName>Martina</adultGuest2FirstName>
      <adultGuest2LastName>Sanchez</adultGuest2LastName>
      <adultGuest3FirstName></adultGuest3FirstName>
      <adultGuest3LastName></adultGuest3LastName>
      <adultGuest4FirstName></adultGuest4FirstName>
      <adultGuest4LastName></adultGuest4LastName>
      <adultGuest5FirstName></adultGuest5FirstName>
      <adultGuest5LastName></adultGuest5LastName>
      <adultGuest6FirstName></adultGuest6FirstName>
      <adultGuest6LastName></adultGuest6LastName>
      <adultGuest7FirstName></adultGuest7FirstName>
      <adultGuest7LastName></adultGuest7LastName>
      <adultGuest8FirstName></adultGuest8FirstName>
      <adultGuest8LastName></adultGuest8LastName>
      <adultGuest9FirstName></adultGuest9FirstName>
      <adultGuest9LastName></adultGuest9LastName>
      <childrenGuest1FirstName></childrenGuest1FirstName>
      <childrenGuest1LastName></childrenGuest1LastName>
      <childrenGuestAge1></childrenGuestAge1>
      <childrenGuest2FirstName></childrenGuest2FirstName>
      <childrenGuest2LastName></childrenGuest2LastName>
      <childrenGuestAge2></childrenGuestAge2>
      <childrenGuest3FirstName></childrenGuest3FirstName>
      <childrenGuest3LastName></childrenGuest3LastName>
      <childrenGuestAge3></childrenGuestAge3>
      <childrenGuest4FirstName></childrenGuest4FirstName>
      <childrenGuest4LastName></childrenGuest4LastName>
      <childrenGuestAge4></childrenGuestAge4>
      <childrenGuest5FirstName></childrenGuest5FirstName>
      <childrenGuest5LastName></childrenGuest5LastName>
      <childrenGuestAge5></childrenGuestAge5>
      <childrenGuest6FirstName></childrenGuest6FirstName>
      <childrenGuest6LastName></childrenGuest6LastName>
      <childrenGuestAge6></childrenGuestAge6>
      <childrenGuest7FirstName></childrenGuest7FirstName>
      <childrenGuest7LastName></childrenGuest7LastName>
      <childrenGuestAge7></childrenGuestAge7>
      <childrenGuest8FirstName></childrenGuest8FirstName>
      <childrenGuest8LastName></childrenGuest8LastName>
      <childrenGuestAge8></childrenGuestAge8>
      <childrenGuest9FirstName></childrenGuest9FirstName>
      <childrenGuest9LastName></childrenGuest9LastName>
      <childrenGuestAge9></childrenGuestAge9>
      <paymentMethodId>1</paymentMethodId>
      <creditCardType></creditCardType>
      <creditCardNumber></creditCardNumber>
      <creditCardHolder></creditCardHolder>
      <creditCardCVV2></creditCardCVV2>
      <creditCardExpYear></creditCardExpYear>
      <creditCardExpMonth></creditCardExpMonth>
      <customerEmail>alexis.sanchez@gmail.com</customerEmail>
      <invoiceRef></invoiceRef>
      <customerCountry>es</customerCountry>
      <b2c>0</b2c>
      <commissionAmountInHotelCurrency></commissionAmountInHotelCurrency>
      <preBookCode>edeacb8e-7aed-43e3-a5fa-a645ff8eefca</preBookCode>
    </BookV2>
  </soap:Body>
</soap:Envelope>